burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
      <register>
        <name>ISQ</name>
        <displayName>ISQ</displayName>
        <description>Inserted sequence register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IL</name>
              <description>Inserted sequence length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISQ3</name>
              <description>Refer to ISQ0[4:0] description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISQ2</name>
              <description>Refer to ISQ0[4:0] description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISQ1</name>
              <description>Refer to ISQ0[4:0] description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISQ0</name>
              <description>The channel number (0..17) is written to these bits to select a channel at the nth conversion in the inserted sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDATA0</name>
        <displayName>LDATA0</displayName>
        <description>Latch data register 0</description>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LDATAn</name>
              <description>Inserted or routine number n conversion data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDATA1</name>
        <displayName>LDATA1</displayName>
        <description>Latch data register 1</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LDATAn</name>
              <description>Inserted or routine number n conversion data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDATA2</name>
        <displayName>LDATA2</displayName>
        <description>Latch data register 2</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LDATAn</name>
              <description>Inserted or routine number n conversion data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDATA3</name>
        <displayName>LDATA3</displayName>
        <description>Latch data register 3</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LDATAn</name>
              <description>Inserted or routine number n conversion data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>RDATA</name>
        <displayName>RDATA</displayName>
        <description>Routine data register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADC1RDATA</name>
              <description>ADC1 routine channel data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDATA</name>
              <description>Routine channel data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IDATA</name>
        <displayName>IDATA</displayName>
        <description>Inserted data register</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IDATA</name>
              <description>Inserted channel data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LDCTL</name>
        <displayName>LDCTL</displayName>
        <description>Latch data control registe</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00010203</resetValue>
        <fields>
            <field>
              <name>SEQSEL0</name>
              <description>The ADC_LDATA0 register sequence source selection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COVSEL0</name>
              <description>The ADC_LDATA0 register conversion source selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQSEL1</name>
              <description>Refer to SEQSEL0 description.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COVSEL1</name>
              <description>Refer to COVSEL0[3:0] description.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQSEL2</name>
              <description>Refer to SEQSEL0 description.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COVSEL2</name>
              <description>Refer to COVSEL0[3:0] description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQSEL3</name>
              <description>Refer to SEQSEL0 description.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COVSEL3</name>
              <description>Refer to COVSEL0[3:0] description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OVSAMPCTL</name>
        <displayName>OVSAMPCTL</displayName>
        <description>Oversample control register</description>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DRES</name>
              <description>ADC resolution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOVS</name>
              <description>Triggered oversampling</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVSS</name>
              <description>Oversampling shift</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVSR</name>
              <description>Oversampling ratio</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVSEN</name>
              <description>Oversampler enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
