burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
    </registers>
</peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40012800</baseAddress>
      <interrupt>
        <name>ADC1</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC2</name>
      <baseAddress>0x40013C00</baseAddress>
      <interrupt>
        <name>ADC2</name>
        <value>47</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>AFIO</name>
      <description>Alternate-function I/Os</description>
      <groupName>AFIO</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
         <name>AFIO_EXTISS0</name>
         <displayName>AFIO_EXTISS0</displayName>
         <description>EXTI sources selection register 0</description>
         <addressOffset>0x08</addressOffset>
         <size>0x20</size>
         <resetValue>0x00000000</resetValue>
         <fields>
             <field>
               <name>EXTI3_SS</name>
               <description>EXTI 3 sources selection</description>
               <bitOffset>12</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI2_SS</name>
               <description>EXTI 2 sources selection</description>
               <bitOffset>8</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI1_SS</name>
               <description>EXTI 1 sources selection</description>
               <bitOffset>4</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI0_SS</name>
               <description>EXTI 0 sources selection</description>
               <bitOffset>0</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
         </fields>
       </register>
       <register>
         <name>AFIO_EXTISS1</name>
         <displayName>AFIO_EXTISS1</displayName>
         <description>EXTI sources selection register 1</description>
         <addressOffset>0x0C</addressOffset>
         <size>0x20</size>
         <resetValue>0x00000000</resetValue>
         <fields>
             <field>
               <name>EXTI7_SS</name>
               <description>EXTI 7 sources selection</description>
               <bitOffset>12</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI6_SS</name>
               <description>EXTI 6 sources selection</description>
               <bitOffset>8</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI5_SS</name>
               <description>EXTI 5 sources selection</description>
               <bitOffset>4</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI4_SS</name>
               <description>EXTI 4 sources selection</description>
               <bitOffset>0</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
         </fields>
       </register>
       <register>
         <name>AFIO_EXTISS2</name>
         <displayName>AFIO_EXTISS2</displayName>
         <description>EXTI sources selection register 2</description>
         <addressOffset>0x10</addressOffset>
         <size>0x20</size>
         <resetValue>0x00000000</resetValue>
         <fields>
             <field>
               <name>EXTI11_SS</name>
               <description>EXTI 11 sources selection</description>
               <bitOffset>12</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI10_SS</name>
               <description>EXTI 10 sources selection</description>
               <bitOffset>8</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI9_SS</name>
               <description>EXTI 9 sources selection</description>
               <bitOffset>4</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI8_SS</name>
               <description>EXTI 8 sources selection</description>
               <bitOffset>0</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
         </fields>
       </register>
       <register>
         <name>AFIO_EXTISS3</name>
         <displayName>AFIO_EXTISS3</displayName>
         <description>EXTI sources selection register 3</description>
         <addressOffset>0x14</addressOffset>
         <size>0x20</size>
         <resetValue>0x00000000</resetValue>
         <fields>
             <field>
               <name>EXTI15_SS</name>
               <description>EXTI 15 sources selection</description>
               <bitOffset>12</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI14_SS</name>
               <description>EXTI 14 sources selection</description>
               <bitOffset>8</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI13_SS</name>
               <description>EXTI 13 sources selection</description>
               <bitOffset>4</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
             <field>
               <name>EXTI12_SS</name>
               <description>EXTI 12 sources selection</description>
               <bitOffset>0</bitOffset>
               <bitWidth>4</bitWidth>
               <access>read-write</access>
             </field>
         </fields>
       </register>
