burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
      </registers>
    </peripheral>
<peripheral>
    <name>CMP</name>
    <description>Comparator</description>
    <groupName>CMP</groupName>
    <baseAddress>0x40007800</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>STAT</name>
        <displayName>STAT</displayName>
        <description>Status register</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMP0IF</name>
              <description>CMP0 interrupt flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP0O</name>
              <description>CMP0 output state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>IFC</name>
        <displayName>IFC</displayName>
        <description>Interrupt flag clear register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMP0IC</name>
              <description>CMP0 interrupt flag clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CMP0_CS</name>
        <displayName>CMP0_CS</displayName>
        <description>CMP0 control/status register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CMP0LK</name>
              <description>CMP0 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0NFM</name>
              <description>Noise filter mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0DNSSEL</name>
              <description>CMP0 digital noise sampling selection.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0BLK</name>
              <description>CMP0 output blanking source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0MSEL</name>
              <description>CMP0_IM internal input selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0HST</name>
              <description>CMP0 hysteresis</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0INTEN</name>
              <description>CMP0 interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0PL</name>
              <description>Polarity of CMP0 output</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0SEN</name>
              <description>Voltage scaler enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0BEN</name>
              <description>Scaler bridge enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0EN</name>
              <description>CMP0 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
    </registers>
</peripheral>
<peripheral>
    <name>DAC</name>
    <description>Digital-to-analog converter</description>
    <groupName>DAC</groupName>
    <baseAddress>0x40007400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>DACx control register 0</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00008000</resetValue>
        <fields>
            <field>
              <name>OUTSEL0</name>
              <description>Select DACx_OUT0 connected to PA4 or PA5 pin</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCSEL0</name>
              <description>When DACx_OUT0 is connected to CMP, connection selection of DACx_OUT0 with GPIO:</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDUDRIE0</name>
              <description>DACx_OUT0 DMA underrun interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDMAEN0</name>
              <description>DACx_OUT0 DMA enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWBW0</name>
              <description>DACx_OUT0 noise wave bit width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWM0</name>
              <description>DACx_OUT0 noise wave mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTSEL0</name>
              <description>DACx_OUT0 trigger selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEN0</name>
              <description>DACx_OUT0 trigger enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBOFF0</name>
              <description>DACx_OUT0 output buffer turn off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEN0</name>
              <description>DACx_OUT0 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>SWT</name>
        <displayName>SWT</displayName>
        <description>DACx software trigger register</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SWTR0</name>
              <description>DACx_OUT0 software trigger, cleared by hardware.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_R12DH</name>
        <displayName>OUT0_R12DH</displayName>
        <description>DACx_OUT0 12-bit right-aligned data holding register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DACx_OUT0 12-bit right-aligned data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_L12DH</name>
        <displayName>OUT0_L12DH</displayName>
        <description>DACx_OUT0 12-bit left-aligned data holding register</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DACx_OUT0 12-bit left-aligned data.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_R8DH</name>
        <displayName>OUT0_R8DH</displayName>
        <description>DACx_OUT0 8-bit right-aligned data holding register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OUT0_DH</name>
              <description>DACx_OUT0 8-bit right-aligned data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OUT0_DO</name>
        <displayName>OUT0_DO</displayName>
        <description>DACx_OUT0 data output register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OUT0_DO</name>
              <description>DACx_OUT0 12-bit output data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT0</name>
        <displayName>STAT0</displayName>
        <description>DACx_OUT0 status register 0</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DDUDR0</name>
              <description>DACx_OUT0 DMA underrun flag.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
