burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
                <register>
                    <name>RM_INTC</name>
                    <displayName>RM_INTC</displayName>
                    <description>Request multiplexer channel interrupt flag clear register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SOIFC11</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC10</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC9</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC8</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC7</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC6</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC5</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC4</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC3</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC2</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC1</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SOIFC0</name>
                            <description>Clear bit for synchronization overrun event flag of request multiplexer channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>




                    </fields>
                </register>
                <register>
                    <name>RG_CH0CFG</name>
                    <displayName>RG_CH0CFG</displayName>
                    <description>Request generator channel 0 configuration regist</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH1CFG</name>
                    <displayName>RG_CH1CFG</displayName>
                    <description>Request generator channel 1 configuration regist</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH2CFG</name>
                    <displayName>RG_CH2CFG</displayName>
                    <description>Request generator channel 2 configuration regist</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_CH3CFG</name>
                    <displayName>RG_CH3CFG</displayName>
                    <description>Request generator channel 3 configuration regist</description>
                    <addressOffset>0x10c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NBRG</name>
                            <description>Number of DMA requests to be generated</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGTP</name>
                            <description>DMAMUX request generator trigger polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RGEN</name>
                            <description>DMAMUX request generator channel x enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOIE</name>
                            <description>Trigger overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TID</name>
                            <description>Trigger input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_INTF</name>
                    <displayName>RG_INTF</displayName>
                    <description>Request generator channel interrupt flag register</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TOIF3</name>
                            <description>Trigger overrun event flag of request generator channel 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF2</name>
                            <description>Trigger overrun event flag of request generator channel 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF1</name>
                            <description>Trigger overrun event flag of request generator channel 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TOIF0</name>
                            <description>Trigger overrun event flag of request generator channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RG_INTC</name>
                    <displayName>RG_INTC</displayName>
                    <description>Rquest generator channel interrupt flag clear register</description>
                    <addressOffset>0x144</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TOIFC3</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC2</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC1</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TOIFC0</name>
                            <description>Clear bit for trigger overrun event flag of request generator channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
