burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
            </registers>
        </peripheral>
<peripheral>
    <name>TRIGSEL</name>
    <description>Flash memory controller</description>
    <groupName>TRIGSEL</groupName>
    <baseAddress>0x40014400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>EXTOUT_0</name>
        <displayName>EXTOUT_0</displayName>
        <description>Trigger selection for EXTOUT register 0</description>
        <addressOffset>0x00</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>EXTOUT_1</name>
        <displayName>EXTOUT_1</displayName>
        <description>Trigger selection for EXTOUT register 1</description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>EXTOUT_2</name>
        <displayName>EXTOUT_2</displayName>
        <description>Trigger selection for EXTOUT register 2</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>EXTOUT_3</name>
        <displayName>EXTOUT_3</displayName>
        <description>Trigger selection for EXTOUT register 3</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER0ETI</name>
        <displayName>TIMER0ETI</displayName>
        <description>Trigger selection for TIMER0_ITI register</description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER1ITI</name>
        <displayName>TIMER1ITI</displayName>
        <description>Trigger selection for TIMER1_ETI register</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER2ITI</name>
        <displayName>TIMER2ITI</displayName>
        <description>Trigger selection for TIMER2_ITI register</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER3ITI</name>
        <displayName>TIMER3ITI</displayName>
        <description>Trigger selection for TIMER3_ITI register</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER4ITI</name>
        <displayName>TIMER4ITI</displayName>
        <description>Trigger selection for TIMER4_ITI register</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER7ITI</name>
        <displayName>TIMER7ITI</displayName>
        <description>Trigger selection for TIMER7_ITI register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER15ITI</name>
        <displayName>TIMER15ITI</displayName>
        <description>Trigger selection for TIMER15_ITI register</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER16ITI</name>
        <displayName>TIMER16ITI</displayName>
        <description>Trigger selection for TIMER16_ITI register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DAC</name>
        <displayName>DAC</displayName>
        <description>Trigger selection for DAC register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC0_ROUTRG</name>
        <displayName>ADC0_ROUTRG</displayName>
        <description>Trigger selection for ADC0_ROUTRG register</description>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC0_INSTRG</name>
        <displayName>ADC0_INSTRG</displayName>
        <description>Trigger selection for ADC0_INSTRG register</description>
        <addressOffset>0x3C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC1_ROUTRG</name>
        <displayName>ADC1_ROUTRG</displayName>
        <description>Trigger selection for ADC1_ROUTRG register</description>
        <addressOffset>0X40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC1_INSTRG</name>
        <displayName>ADC1_INSTRG</displayName>
        <description>Trigger selection for ADC1_INSTRG register</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC2_ROUTRG</name>
        <displayName>ADC2_ROUTRG</displayName>
        <description>Trigger selection for ADC2_ROUTRG register</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADC2_INSTRG</name>
        <displayName>ADC2_INSTRG</displayName>
        <description>Trigger selection for ADC2_INSTRG register</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER0BRKIN</name>
        <displayName>TIMER0BRKIN</displayName>
        <description>Trigger selection for TIMER0_BRKIN register</description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000042</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for TIMER0_BRKIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER0CHBRKIN</name>
        <displayName>TIMER0CHBRKIN</displayName>
        <description>Trigger selection for TIMER0_CHBRKIN register</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00454443</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for TIMER0_CH2BRKIN.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for TIMER0_CH1BRKIN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for TIMER0_CH0BRKIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER7BRKIN</name>
        <displayName>TIMER7BRKIN</displayName>
        <description>Trigger selection for TIMER7_BRKIN register</description>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000046</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for TIMER7_BRKIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER7CHBRKIN</name>
        <displayName>TIMER7CHBRKIN</displayName>
        <description>Trigger selection for TIMER7_CHBRKIN register</description>
        <addressOffset>0x5C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00494847</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for TIMER7_CH2BRKIN.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for TIMER7_CH1BRKIN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for TIMER7_CH0BRKIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER15BRKIN</name>
        <displayName>TIMER15BRKIN</displayName>
        <description>Trigger selection for TIMER15_BRKIN register</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000004A</resetValue>
        <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for TIMER15_BRKIN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
