burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
      </registers>
    </peripheral>
<peripheral>
    <name>FMC</name>
    <description>Flash memory controller</description>
    <groupName>FMC</groupName>
    <baseAddress>0x40022000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <registers>
      <register>
        <name>KEY0</name>
        <displayName>KEY0</displayName>
        <description>Unlock key register </description>
        <addressOffset>0x04</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>KEY</name>
              <description>FMC_CTL0 unlock register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBKEY</name>
        <displayName>OBKEY</displayName>
        <description>Option byte unlock key register</description>
        <addressOffset>0x08</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>OBKEY</name>
              <description>Option bytes operation unlock register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT0</name>
        <displayName>STAT0</displayName>
        <description>Status register 0</description>
        <addressOffset>0x0C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ENDF</name>
              <description>End of operation flag bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPERR</name>
              <description>Erase/Program protection error flag bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERR</name>
              <description>Program error flag bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>The flash is busy bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL0</name>
        <displayName>CTL0</displayName>
        <description>Control register </description>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000080</resetValue>
        <fields>
            <field>
              <name>NWLDE</name>
              <description>Enable no waiting time area load when system reset. No waiting time area load include load option bytes, OTP, main flash code area.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDN</name>
              <description>Flash enter to Deep Power Down mode when no operation.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLBE</name>
              <description>Enable read lock block for OTP2.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENDIE</name>
              <description>End of operation interrupt enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LK</name>
              <description>FMC_CTL0 lock bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Send erase command to FMC bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MER</name>
              <description>Main flash mass erase for bank0 command bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PER</name>
              <description>Main flash page erase for bank0 command bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG</name>
              <description>Main flash program for bank0 command bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDR0</name>
        <displayName>ADDR0</displayName>
        <description>Address register 0</description>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADDR</name>
              <description>Flash erase command address bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBCTL0</name>
        <displayName>OBCTL0</displayName>
        <description>Option byte control register 0</description>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SPC</name>
              <description>Option byte security protection code.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OB_START</name>
              <description>Send option byte change command to FMC bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OB_LK</name>
              <description>FMC_OBCTL0/1/2 lock bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBCTL1</name>
        <displayName>OBCTL1</displayName>
        <description>Option byte control register 1</description>
        <addressOffset>0x1C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DATA</name>
              <description>Store DATA of option bytes block after system reset.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USER</name>
              <description>Store USER of option bytes block after system reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OBERR</name>
              <description>Option bytes read error bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBCTL2</name>
        <displayName>OBCTL2</displayName>
        <description>Option byte control register 2</description>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>WP</name>
              <description>Store WP of option bytes block after system reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OTP1CFG</name>
        <displayName>OTP1CFG</displayName>
        <description>OTP1 configuration register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x0000FFFF</resetValue>
        <fields>
            <field>
              <name>OTP1REN</name>
              <description>OTP1 read enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OBSTAT</name>
        <displayName>OBSTAT</displayName>
        <description>Option bytes status register</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>SPCH</name>
              <description>Security protection is level high now.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPCL</name>
              <description>Security protection is level low now.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>KEY1</name>
        <displayName>KEY1</displayName>
        <description>Unlock key register </description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>KEY</name>
              <description>FMC_CTL1 unlock register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>STAT1</name>
        <displayName>STAT1</displayName>
        <description>Status register 1</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ENDF</name>
              <description>End of operation flag bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPERR</name>
              <description>Erase/Program protection error flag bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERR</name>
              <description>Program error flag bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>The flash is busy bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CTL1</name>
        <displayName>CTL1</displayName>
        <description>Control register </description>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000080</resetValue>
        <fields>
            <field>
              <name>ENDIE</name>
              <description>End of operation interrupt enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LK</name>
              <description>FMC_CTL1 lock bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Send erase command to FMC bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MER</name>
              <description>Main flash mass erase for bank1 command bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PER</name>
              <description>Main flash page erase for bank1 command bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PG</name>
              <description>Main flash program for bank1 command bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDR1</name>
        <displayName>ADDR1</displayName>
        <description>Address register 1</description>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>ADDR</name>
              <description>Flash erase command address bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>OTP3_STAT</name>
        <displayName>OTP3_STAT</displayName>
        <description>OTP3 status register</description>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>BTFOSEL_LK</name>
              <description>BTFOSEL lock status.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NBTSB_LK</name>
              <description>NBTSB lock status.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NDBG_LK</name>
              <description>NDBG lock status.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BTFOSEL</name>
              <description>Select Boot from flash or OTP1. This bit actives when NBTSB is 1 or BOOT0 is 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NBTSB</name>
              <description>Not boot from SRAM or bootloader.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NDBG</name>
              <description>Debugging permission setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PID</name>
        <displayName>PID</displayName>
        <description>Product ID register</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PID</name>
              <description>Product reserved ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
