burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
      <register>
        <name>RSTSCK</name>
        <displayName>RSTSCK</displayName>
        <description>Reset source/clock register</description>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <resetValue>0x0C000000</resetValue>
        <fields>
            <field>
              <name>LPRSTF</name>
              <description>Low-power reset flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGTRSTF</name>
              <description>Window watchdog timer reset flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FWDGTRSTF</name>
              <description>Free watchdog timer reset flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWRSTF</name>
              <description>Software reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>Power reset flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPRSTF</name>
              <description>External pin reset flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTFC</name>
              <description>Reset flag clear</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC40KSTB</name>
              <description>IRC40K stabilization flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC40KEN</name>
              <description>IRC40K enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>AHBRST</name>
        <displayName>AHBRST</displayName>
        <description>AHB reset register</description>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>DMA1RST</name>
              <description>DMA0 reset</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA0RST</name>
              <description>DMA1 reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAMUXRST</name>
              <description>DMAMUX reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRNGRST</name>
              <description>TRNG reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HAURST</name>
              <description>HAU reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAURST</name>
              <description>CAU reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBFSRST</name>
              <description>USBFS reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CFG1</name>
        <displayName>CFG1</displayName>
        <description>Clock configuration register 1</description>
        <addressOffset>0x2C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000400</resetValue>
        <fields>
            <field>
              <name>ADCPSC</name>
              <description>Bit 4 of ADCPSC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC40KCALIB</name>
              <description>Internal 40KHz RC oscillator calibration value register</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL0SEL</name>
              <description>PLL0 clock source selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALRDYRST</name>
              <description>HXTAL ready reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S2SEL</name>
              <description>I2S2 Clock Source Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1SEL</name>
              <description>I2S1 Clock Source Selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL1SEL</name>
              <description>PLL1 clock source selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL1MF</name>
              <description>The PLL1 clock multiplication factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREDIV1</name>
              <description>PREDIV1 division factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREDIV0</name>
              <description>PREDIV0 division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>PLLBWCFG</name>
        <displayName>PLLBWCFG</displayName>
        <description>PLL bandwidth configuration register</description>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PLL1_BW_CFG</name>
              <description>PLL1 bandwidth configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL0_BW_CFG</name>
              <description>PLL0 bandwidth configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>DSV</name>
        <displayName>DSV</displayName>
        <description>Deep-sleep mode voltage register</description>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <resetValue>0x000A0000</resetValue>
        <fields>
            <field>
              <name>SWDLY</name>
              <description>switch delay time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLPVS</name>
              <description>Deep-sleep mode voltage select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CKFMCFG0</name>
        <displayName>CKFMCFG0</displayName>
        <description>Clock frequency monitor configuration register 0</description>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IRC8MCKFFIE</name>
              <description>IRC8M clock frequency failure interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC8MCKFFC</name>
              <description>IRC8M clock frequency failure flag clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC8MCKFFF</name>
              <description>IRC8M clock frequency failure flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC8MCKFMC</name>
              <description>IRC8M clock frequency monitor configuration</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC8MCKFMEN</name>
              <description>IRC8M clock frequency monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CKFMCFG1</name>
        <displayName>CKFMCFG1</displayName>
        <description>Clock frequency monitor configuration register 1</description>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>HXTALCKFFC</name>
              <description>HXTAL clock frequency failure flag clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALCKFFF</name>
              <description>HXTAL clock frequency failure flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HXTALCKFFIE</name>
              <description>HXTAL clock frequency failure interrupt enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALCKFMIN</name>
              <description>HXTAL clock frequency monitor configuration minimum value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALCKFMAX</name>
              <description>HXTAL clock frequency monitor configuration maximum value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HXTALCKFMEN</name>
              <description>HXTAL clock frequency monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CKFMCFG2</name>
        <displayName>CKFMCFG2</displayName>
        <description>Clock frequency monitor configuration register 2</description>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PLL0PCKFFC</name>
              <description>PLL0P clock frequency failure flag clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL0PCKFFF</name>
              <description>PLL0P clock frequency failure flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL0PCKFFIE</name>
              <description>PLL0P clock frequency failure interrupt enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL0PCKFMIN</name>
              <description>PLL0P clock frequency monitor configuration minimum value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL0PCKFMAX</name>
              <description>PLL0P clock frequency monitor configuration maximum value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL0PCKFMEN</name>
              <description>PLL0P clock frequency monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>CKFMCFG3</name>
        <displayName>CKFMCFG3</displayName>
        <description>Clock frequency monitor configuration register 3</description>
        <addressOffset>0x4C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>PLL1CKFFC</name>
              <description>PLL1 clock frequency failure flag clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL1CKFFF</name>
              <description>PLL1 clock frequency failure flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL1CKFFIE</name>
              <description>PLL1 clock frequency failure interrupt enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL1CKFMIN</name>
              <description>PLL1 clock frequency monitor configuration minimum value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL1CKFMAX</name>
              <description>PLL1 clock frequency monitor configuration maximum value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL1CKFMEN</name>
              <description>PLL1 clock frequency monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDCTL</name>
        <displayName>ADDCTL</displayName>
        <description>Additional clock control register</description>
        <addressOffset>0xC0</addressOffset>
        <size>0x20</size>
        <resetValue>0x80000000</resetValue>
        <fields>
            <field>
              <name>IRC48MCALIB</name>
              <description>Internal 48MHz RC oscillator calibration value register</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2S2DIV</name>
              <description>I2S2 divider</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MSTB</name>
              <description>Internal 48MHz RC oscillator clock stabilization flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC48MEN</name>
              <description>Internal 48MHz RC oscillator enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMCDIV</name>
              <description>FMC divider</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL0DIV</name>
              <description>PLL0 divider</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S1DIV</name>
              <description>I2S1 divider</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMCSEL</name>
              <description>FMC clock source selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK48MSEL</name>
              <description>48MHz clock selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDINT</name>
        <displayName>ADDINT</displayName>
        <description>Additional clock interrupt register</description>
        <addressOffset>0xCC</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>IRC48MSTBIC</name>
              <description>Internal 48 MHz RC oscillator stabilization interrupt clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IRC48MSTBIE</name>
              <description>Internal 48 MHz RC oscillator stabilization interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MSTBIF</name>
              <description>IRC48M stabilization interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDAPB1RST</name>
        <displayName>ADDAPB1RST</displayName>
        <description>APB1 additional reset register</description>
        <addressOffset>0xE0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CTCRST</name>
              <description>CTC reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>ADDAPB1EN</name>
        <displayName>ADDAPB1EN</displayName>
        <description>APB1 additional enable register</description>
        <addressOffset>0xE4</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>CTCEN</name>
              <description>CTC clock enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>LOCK</name>
        <displayName>LOCK</displayName>
        <description>LOCK register</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>LOCK</name>
              <description>RCU register lock bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
