burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
        <register>
          <name>HNPTFLEN</name>
          <displayName>HNPTFLEN</displayName>
          <description>Host non-periodic transmit FIFO length register
          (Host mode)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000200</resetValue>
          <fields>
            <field>
              <name>HNPTXRSAR</name>
              <description>host non-periodic transmit Tx RAM start
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>HNPTXFD</name>
              <description>host non-periodic TxFIFO depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEP0TFLEN</name>
          <displayName>DIEP0TFLEN</displayName>
          <description>Device IN endpoint 0 transmit FIFO length
          (Device mode)</description>
          <alternateRegister>HNPTFLEN</alternateRegister>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000200</resetValue>
          <fields>
            <field>
              <name>IEP0TXFD</name>
              <description>in endpoint 0 Tx FIFO depth</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>IEP0TXRSAR</name>
              <description>in endpoint 0 Tx RAM start address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HNPTFQSTAT</name>
          <displayName>HNPTFQSTAT</displayName>
          <description>Host non-periodic transmit FIFO/queue
          status register (HNPTFQSTAT)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00080200</resetValue>
          <fields>
            <field>
              <name>NPTXFS</name>
              <description>Non-periodic TxFIFO space</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>NPTXRQS</name>
              <description>Non-periodic transmit request queue
              space </description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NPTXRQTOP</name>
              <description>Top of the non-periodic transmit request
              queue</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GCCFG</name>
          <displayName>GCCFG</displayName>
          <description>Global core configuration register (USBFS_GCCFG)</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRON</name>
              <description>Power on</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFOEN</name>
              <description>SOF output enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CID</name>
          <displayName>CID</displayName>
          <description>core ID register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>CID</name>
              <description>Core ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTFLEN</name>
          <displayName>HPTFLEN</displayName>
          <description>Host periodic transmit FIFO length register (HPTFLEN)</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000600</resetValue>
          <fields>
            <field>
              <name>HPTXFSAR</name>
              <description>Host periodic TxFIFO start
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>HPTXFD</name>
              <description>Host periodic TxFIFO depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEP1TFLEN</name>
          <displayName>DIEP1TFLEN</displayName>
          <description>device IN endpoint transmit FIFO size
          register (DIEP1TFLEN)</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000400</resetValue>
          <fields>
            <field>
              <name>IEPTXRSAR</name>
              <description>IN endpoint FIFO transmit RAM start
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>IEPTXFD</name>
              <description>IN endpoint TxFIFO depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEP2TFLEN</name>
          <displayName>DIEP2TFLEN</displayName>
          <description>device IN endpoint transmit FIFO size
          register (DIEP2TFLEN)</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000400</resetValue>
          <fields>
            <field>
              <name>IEPTXRSAR</name>
              <description>IN endpoint FIFO transmit RAM start
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>IEPTXFD</name>
              <description>IN endpoint TxFIFO depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEP3TFLEN</name>
          <displayName>DIEP3TFLEN</displayName>
          <description>device IN endpoint transmit FIFO size
          register (FS_DIEP3TXFLEN)</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000400</resetValue>
          <fields>
            <field>
              <name>IEPTXRSAR</name>
              <description>IN endpoint FIFO4 transmit RAM start
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>IEPTXFD</name>
              <description>IN endpoint TxFIFO depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
