burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
      <register>
        <name>TIMER0CFG0</name>
        <displayName>TIMER0CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER0CFG1</name>
        <displayName>TIMER0CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER0CFG2</name>
        <displayName>TIMER0CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER7CFG0</name>
        <displayName>TIMER7CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x13C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER7CFG1</name>
        <displayName>TIMER7CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER7CFG2</name>
        <displayName>TIMER7CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER1CFG0</name>
        <displayName>TIMER1CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x10C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER1CFG1</name>
        <displayName>TIMER1CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG11</name>
              <description>Decoder mode 2 configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>Decoder mode 1 configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>Decoder mode 0 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER1CFG2</name>
        <displayName>TIMER1CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG14</name>
              <description>Quadrature decoder mode 4 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG13</name>
              <description>Quadrature decoder mode 3 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Decoder mode 3 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER2CFG0</name>
        <displayName>TIMER2CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER2CFG1</name>
        <displayName>TIMER2CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x11C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG11</name>
              <description>Decoder mode 2 configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>Decoder mode 1 configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>Decoder mode 0 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER2CFG2</name>
        <displayName>TIMER2CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG14</name>
              <description>Quadrature decoder mode 4 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG13</name>
              <description>Quadrature decoder mode 3 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Decoder mode 3 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER3CFG0</name>
        <displayName>TIMER3CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER3CFG1</name>
        <displayName>TIMER3CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG11</name>
              <description>Decoder mode 2 configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>Decoder mode 1 configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>Decoder mode 0 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER3CFG2</name>
        <displayName>TIMER3CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x12C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG14</name>
              <description>Quadrature decoder mode 4 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG13</name>
              <description>Quadrature decoder mode 3 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Decoder mode 3 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER4CFG0</name>
        <displayName>TIMER4CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG2</name>
              <description>Quadrature decoder mode 2 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG1</name>
              <description>Quadrature decoder mode 1 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG0</name>
              <description>Quadrature decoder mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER4CFG1</name>
        <displayName>TIMER4CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG11</name>
              <description>Decoder mode 2 configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG10</name>
              <description>Decoder mode 1 configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG9</name>
              <description>Decoder mode 0 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
