burakenez/gd32f50x-demo-suites-cmake-vscode/Projects/GD32F503V_EVAL/23_USB_FS_USB_Device_HID_Keyboard/GD32F50x.svd
      <register>
        <name>TIMER4CFG2</name>
        <displayName>TIMER4CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG14</name>
              <description>Quadrature decoder mode 4 configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG13</name>
              <description>Quadrature decoder mode 3 configuration</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG12</name>
              <description>Decoder mode 3 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER15CFG0</name>
        <displayName>TIMER15CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER15CFG1</name>
        <displayName>TIMER15CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x14C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER15CFG2</name>
        <displayName>TIMER15CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER16CFG0</name>
        <displayName>TIMER16CFG0</displayName>
        <description>TIMERx configuration register 0</description>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG5</name>
              <description>Event mode configuration</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG4</name>
              <description>Pause mode configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFG3</name>
              <description>Restart mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER16CFG1</name>
        <displayName>TIMER16CFG1</displayName>
        <description>TIMERx configuration register 1</description>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG6</name>
              <description>External clock mode 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
      <register>
        <name>TIMER16CFG2</name>
        <displayName>TIMER16CFG2</displayName>
        <description>TIMERx configuration register 2</description>
        <addressOffset>0x15C</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
            <field>
              <name>TSCFG15</name>
              <description>Internal trigger input source configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
        </fields>
      </register>
    </registers>
    </peripheral>
  </peripherals>
</device>
